Repository: m-rahimy/xfardic
Catalog: xfardic-src/locales/*/xfardic.po
Languages: az_az, fa_ir

source: &Close
az_az: Bağla
fa_ir: بستن

source: Alan Baghumian <alan@technotux.org> Armen Baghumian <armen@opensourceclub.org>
fa_ir: آلن باغومیان <alan@technotux.org> آرمن باغومیان <armen@opensourceclub.org>

source: xFarDic
fa_ir: ایکس‌فاردیک

source: Latest News and Updates: http://www.xfardic.org Bug Report/Feature Request: alan@technotux.org IMPORTANT NOTICE: You can get required XDB word databases from project home page at http://sf.net/projects/xfardic. Without word databases, xFarDic *will not* work.
fa_ir: آخرین اخبار و جدیدترین نسخه‌ها: http://www.xfardic.org گزارش اشکالات و تقاضای قابلیت‌های جدید: alan@technotux.org تذکر مهم: می‌توانید بانک‌ اطلاعاتی واژه‌های مورد نیاز را از: http://sf.net/projects/xfardic دریافت کنید. بدون بانک اطلاعاتی واژه‌ها، ایکس‌فاردیک کار *نخواهد کرد*.

source: xFarDic is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. xFarDic is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fa_ir: ایکس‌فاردیک یک نرم‌افزار آزاد است. شما می‌توانید آنرا تحت شرایط پروانه GPL نسخه ۲ یا بالاتر (بنا به انتخاب خودتان) مجددا توزیع کرده و یا تغییر دهید. ایکس‌فاردیک با امید به سودمند بودن و بدون هر گونه ضمانتی منتشر شده است. برای اطلاعات دقیق‌تر می‌توانید متن پروانه GPL را مطالعه نمایید.

source: Information
az_az: mə'lumatı
fa_ir: اطلاعات

source: License
az_az: Lisenziya
fa_ir: پروانه

source: Authors
az_az: ·Verilənlər bazalarının yazırı :
fa_ir: نویسندگان

source: &OK
az_az: &Oldu
fa_ir: تایید

source: &Clear
fa_ir: پاک کردن

source: Leitner box can be used to support memorization by way of spaced repetition. This is how it works: you try to recall the meaning of a word. If you succeed, you send the word to the next box. But if you fail, you send it back to the first box.
fa_ir: جعبه لایتنر برای پشتیبانی از یادگیری واژه‌ها بر اساس تکرار با فاصله عمل می‌کند. نحوه کارکرد آن بدین صورت است که شما سعی خواهید کرد تا معنای کلمه‌ای را به خاطر آورید. اگر موفق شدید، کلمه را به جعبه قبلی و در غیر این صورت به جعبه نخست باز خواهید گرداند.

source: Word Count:
fa_ir: تعداد کلمات:

source: Box A
fa_ir: جعبه الف

source: Box B
fa_ir: جعبه ب

source: Box C
fa_ir: جعبه پ

source: Box D
fa_ir: جعبه ت

source: Box E
fa_ir: جعبه ث

source: Please select a word.
fa_ir: لطفا یک واژه را انتخاب نمایید.

source: Box B is full.
fa_ir: ظرفیت جعبه ب تکمیل است.

source: Are you sure that you have learnt this word?
fa_ir: آیا اطمینان دارید که این واژه را کاملا فرا گرفته‌اید؟

source: Are you sure that you want to clear the box contents?
fa_ir: آیا از پاک کردن محتویات جعبه اطمینان دارید؟

source: Box A is full.
fa_ir: ظرفیت جعبه الف تکمیل است.

source: Box C is full.
fa_ir: ظرفیت جعبه پ تکمیل است.

source: Box D is full.
fa_ir: ظرفیت جعبه ت تکمیل است.

source: Box E is full.
fa_ir: ظرفیت جعبه ث تکمیل است.

source: Here you can configure your desired options. Changes will take effect after xFarDic restart.
az_az: Bu pəncərədə proqrəminizin artıq seçimlərini qura bilərsiniz. dəyiştirilən seçimlər gələn dəfə proqrəmi çalışdıranda aktiv ediləcək
fa_ir: در این پنجره می‌توانید گزینه‌های مورد نظرتان را تنظیم کنید. تغییرات پس از راه‌اندازی مجدد نرم‌افزار اعمال خواهند شد.

source: Persian
az_az: Farsca
fa_ir: فارسی

source: English (U.S)
az_az: İngilizcə
fa_ir: انگلیسی

source: System default
az_az: On gurğulu sistem
fa_ir: پیش‌گزیده سیستم

source: Choose default &language:
az_az: Ön qurğu&lu dil :
fa_ir: زبان رابط کاربری:

source: Number of Entries in History Box:
az_az: Keçmiş qutusunda :
fa_ir: تعداد ورودی‌ها در جعبه تاریخچه:

source: Notification window timeout (Sec):
fa_ir: زمان بسته شدن خودکار پنجره اعلان (ثانیه):

source: Leitner box base capacity:
fa_ir: طرفیت جعبه لایتنر:

source: Enable Auto &Select Word After Translation
az_az: Tərcümə Etmədən sonra avtomatik olaraq seç
fa_ir: انتخاب خودکار واژه پس از برگردان فعال شود

source: &Hide On Window Minimize and Close
fa_ir: پنجره هنگام کوچک شدن و بستن مخفی شود

source: Enable Inexact &Reverse Searching
az_az: Qarşı qeyri-dəqiq Axtarış
fa_ir: جستجوی نادقیق برعکس فعال شود

source: Save Program Window P&osition and State
fa_ir: محل قرارگیری و وضعیت پنجره برنامه ذخیره شود

source: Save Wor&d Cache On Exit
az_az: Çıxşda Keçmişi qeyd et
fa_ir: تاریخچه واژه‌ها هنگام خروج ذخیره شود

source: Enable Clipboard &Watcher
az_az: Ara yaddaşdakı· sensörün dəstəyi
fa_ir: حس‌گر حافظه فعال شود

source: Enable Selection Sca&nner
fa_ir: حس‌گر انتخاب فعال شود

source: Enable Noti&fication Window
fa_ir: نمایش پنجره اعلان فعال شود

source: Spea&k On Translation
fa_ir: انجام تلفظ هنگام ترجمه

source: Return Si&milar Words
az_az: Bənzər kəlmələri göstər
fa_ir: برگردان کلمات مشابه

source: Enable S&pell Checker
az_az: İmlanı yoxlaması
fa_ir: غلط یاب املایی فعال شود

source: Enable Swa&p file
fa_ir: حافظه موقت فعال شود

source: Enable Text to Speech En&gine
fa_ir: سیستم تلفظ واژه‌ها فعال شود

source: &Apply
az_az: Tətbiq Et
fa_ir: اعمال

source: &Cancel
az_az: &Ləğv Et
fa_ir: انصراف

source: XML DB Path:
az_az: XML VB Adresi:
fa_ir: مسیر بانک:

source: Add
az_az: Əlavə Et
fa_ir: اضافه کردن

source: DB info
az_az: VB bilgiləri
fa_ir: اطلاعات

source: Up
fa_ir: صعودی

source: Down
fa_ir: نزولی

source: Ctrl+Click to enable or disable available database(s).
az_az: ·Verilənlər·bazalarıni İstifadə etmə/ İstifadə etməməsinə Ctrl+Click
fa_ir: برای فعال یا غیر فعال کردن بانک‌های موجود از Ctrl+Click استفاده نمایید.

source: Enabling swap reduces memory usage by 60% and performance by 15%.
fa_ir: فعال کردن swap باعث صرفه‌جویی در مصرف حافظه به میزان ۶۰٪ و کاهش سرعت به میزان ۱۵٪ خواهد شد.

source: Options
az_az: Seçimlər
fa_ir: گزینه‌ها

source: Databases
az_az: Verilənlər bazaları
fa_ir: بانک‌های اطلاعاتی

source: XML DB path is empty. xFarDic will now work without a valid database.
az_az: XML VB adresi yox. İtibarlı bir VB olmasa xFarDic çalışmaz
fa_ir: مسیر بانک اطلاعاای XML خالی است. xFarDic بدون یک بانک اطلاعاتی معتبر کار نخواهد کرد.

source: Warning
az_az: Xəbərdarlıq
fa_ir: هشدار

source: Choose a XML DataBase
az_az: Bir XML VB seç
fa_ir: انتخاب بانک اطلاعاتی XML

source: XML DataBase files (*.xdb)|*.xdb
az_az: XML VB fayları (*.xdb)|*.xdb
fa_ir: بانک‌های اطلاعاتی XML (*.xdb)|*.xdb

source: DB Name :
az_az: VB Adı :
fa_ir: نام بانک اطلاعاتی :

source: DB Author :
az_az: VB yazıçısı :
fa_ir: نویسنده بانک اطلاعاتی:

source: DB Version:
az_az: VB Versiyonü :
fa_ir: شماره نسخه بانک :

source: Input Lang:
az_az: VB dili :
fa_ir: زبان ورودی بانک :

source: No information found.
az_az: Heç bilgi tapılmadı.
fa_ir: اطلاعاتی یافت نشد.

source: No information found or no databse is selected.
az_az: Heç mə'lumat tapılmadı.
fa_ir: اطلاعاتی یافت نشد یا هیچ بانک اطلاعاتی انتخاب نشده است.

source: XML Database information
az_az: XML VB'nin mə'lumati
fa_ir: اطلاعات بانک XML

source: Parse Error. Invalid Document.
az_az: Xəta : Verilənlər Bazasi Boşdur.
fa_ir: خطا: بانک اطلاعاتی خالی است.

source: &About... F1
az_az: H&aqqında... F1
fa_ir: &درباره... F1

source: Show about dialog
az_az: Haqqinda pəncərəsini göstər
fa_ir: نمایش پنجره درباره

source: Leitner box Ctrl+B
fa_ir: جعبه لایتنر Ctrl+B

source: Show Leitner box
fa_ir: نمایش جعبه لایتنر

source: View Toolbar Ctrl-T
az_az: Vasitələr çobuğu Ctrl-T
fa_ir: نمایش نوار ابزار Ctrl-T

source: Toggle toolbar On/Off
az_az: Vasitə çobuğu Aktiv/qeyri aktiv
fa_ir: فعال/غیر فعال کردن نوار ابزار

source: Translate Alt-T
az_az: Tərcumə et Alt-T
fa_ir: برگردان Alt-T

source: Translate word
az_az: Kəlməni çevir
fa_ir: برگردان واژه

source: Add to leitner box Alt-X
fa_ir: به جعبه لایتنر اضافه شود Alt-X

source: Add word to the leitner box
fa_ir: اضافه کردن کلمه به جعبه لایتنر

source: Pronounce Alt-P
fa_ir: تلفظ Alt-P

source: For&ward Alt-W
az_az: İrəli get Alt-W
fa_ir: مرور به جلو Alt-W

source: Next word
az_az: Sonrakı kəlmə
fa_ir: واژه بعدی

source: &Back Alt-B
az_az: Geri get Alt-B
fa_ir: مرور به عقب Alt-B

source: Previous word
az_az: Öncəki kəlmə
fa_ir: واژه قبلی

source: Fi&rst Word Alt+R
az_az: Bi&rinci Kəlmə Alt+R
fa_ir: نخستین واژه Alt+R

source: First word
az_az: İlk Kəlmə
fa_ir: نخستین واژه

source: &Last Word Alt+L
az_az: &Sonuncu kəlmə Alt+L
fa_ir: آخرین واژه Alt+L

source: Last word
az_az: Son Kəlmə
fa_ir: آخرین واژه

source: &Quit Ctrl+Q
az_az: Kəs Ctrl-X
fa_ir: خروج Ctrl+Q

source: Quit this program
az_az: Proqramdan çıx
fa_ir: خروج از برنامه

source: Auto &Select Alt-S
az_az: Avtomatik seçilim Alt-S
fa_ir: انتخاب خودکار Alt-S

source: Auto select word
az_az: Avtomatik kəlmə seçmə
fa_ir: انتخاب خودکار واژه

source: Enable Clipboard &Watcher Ctrl-W
az_az: Ara yaddaşdakı sensörü fəallaşdır Ctrl-W
fa_ir: حس‌گر حافظه فعال شود Ctrl-W

source: Enable clipboard watcher
az_az: Ara yaddaşdakı sensörün fəallaşdır
fa_ir: حس‌گر حافظه فعال شود Ctrl-W

source: Enable Selection Sca&nner Ctrl-N
az_az: Ara yaddaşdakı sensörün fəallaşdır Ctrl-W
fa_ir: حس‌گر انتخاب فعال شود Ctrl-W

source: Enable selection scanner
az_az: Selection Scanneri fəallaşdır
fa_ir: حس‌گر انتخاب فعال شود Ctrl-W

source: Return Similar Words Ctrl-S
az_az: Bənzər kəlmələri qaytar Ctrl-S
fa_ir: برگردان واژه‌های مشابه Ctrl-S

source: Return similar words
az_az: Bənzər kəlmələri qaytar
fa_ir: برگردان واژه‌های مشابه

source: Enable &Hide On Minimize and Close Ctrl-H
az_az: Pəncərəni kiçildəndə gizlə Ctrl-H
fa_ir: مخفی کردن پنجره هنگام کوچک شدن و بسته شدن Ctrl-H

source: Enable hide on minimize and close
az_az: Pəncərəni kiçildəndə gizlə
fa_ir: مخفی کردن پنجره هنگام کوچک شدن و بسته شدن

source: Enable S&pell Checking Ctrl-P
az_az: İmlani yoxla Ctrl-P
fa_ir: غلط یاب املایی فعال شود Ctrl-P

source: Enable spell checking
az_az: İmla yoxlamasını fəallaçtir
fa_ir: غلط یاب املایی فعال شود

source: Enable Inexact &Reverse Searching Ctrl-R
az_az: Qarşı qeyri-dəqiq Axtarış Ctrl-R
fa_ir: جستجوی نادقیق برعکس فعال شود Ctrl-R

source: Enable inexact reverse searchning
az_az: Qarşı qeyri-dəqiq Axtarış
fa_ir: جستجوی نادقیق برعکس فعال شود

source: Enable N&otification Window Ctrl-O
fa_ir: نمایش پنجره اعلان فعال شود Ctrl-O

source: Enable notification window
fa_ir: نمایش پنجره اعلان فعال شود

source: Set Result Box Font Ctrl-F
az_az: Yazı növü Ctrl+F
fa_ir: تنظیم قلم جعبه نتایج Ctrl+F

source: Set result box font
az_az: Yazı növü
fa_ir: تنظیم قلم جعبه نتایج

source: C&ut Ctrl-X
az_az: Kəs Ctrl-X
fa_ir: بریدن Ctrl-X

source: Cut input text
az_az: Verilən mətni kəs
fa_ir: بریدن متن ورودی

source: &Copy Ctrl-C
az_az: Köçür Ctrl-C
fa_ir: کپی Ctrl-C

source: Copy result to clipboard
az_az: Ara yaddaşda köçür
fa_ir: کپی نتیجه در حافظه

source: &Paste and Translate Ctrl-V
az_az: Yapışdır və tərcümə et Ctrl-V
fa_ir: چسباندن و برگردان Ctrl-V

source: Paste from clipboard
az_az: Ara yaddaşdan yapışdır
fa_ir: چسباندن از حافظه

source: Clear History Ctrl-D
az_az: Keçmişi sil Ctrl-D
fa_ir: پاک کردن تاریخچه Ctrl-D

source: Clear history
az_az: Keçmişi sil
fa_ir: پاک کردن تاریخچه

source: Preferences
fa_ir: ترجیحات

source: Configure settings
az_az: Qurğular
fa_ir: انجام تنظیمات

source: &File
az_az: &Fayl
fa_ir: پرونده

source: &Edit
az_az: Düzəlt
fa_ir: ویرایش

source: &View
az_az: Görünüş
fa_ir: نمایش

source: Too&ls
fa_ir: ابزار

source: &Help
az_az: Yardım
fa_ir: کمک

source: Input text is too long.
az_az: Verilən mətn çox.
fa_ir: متن ورودی بیش از حد طولانی است.

source: Set Result Box Font Ctrl+F
az_az: Yazı növü Ctrl+F
fa_ir: تنظیم قلم جعبه خروجی Ctrl+F

source: Open Preferences
fa_ir: باز کردن ترجیحات

source: &About xFarDic F1
az_az: xFarDic Haqqında F1
fa_ir: درباره xFarDic F1

source: Back
az_az: Geri
fa_ir: قبلی

source: Previous Word
az_az: Öncəki kəlmə
fa_ir: واژه قبلی

source: Fwd
az_az: İrəli
fa_ir: بعدی

source: Next Word
az_az: Sonraki kəlmə
fa_ir: واژه بعدی

source: Cut
az_az: kəs
fa_ir: بریدن

source: Copy
az_az: Köçür
fa_ir: کپی

source: Copy Result
az_az: Nəticəni köçür
fa_ir: کپی نتیجه

source: Paste
az_az: Yapışdır
fa_ir: چسباندن

source: Paste and Translate
az_az: Yapışdır və tərcümə et
fa_ir: چسباندن و برگردان

source: Trash
az_az: Zibil·Qutus
fa_ir: پاک کردن تاریخچه

source: Clear History
az_az: Keçmişi sil
fa_ir: پاک کردن تاریخچه

source: Select
az_az: Seç
fa_ir: انتخاب

source: Auto Select Text
az_az: Avtomatik mətn seç
fa_ir: انتخاب خودکار متن

source: Spell
az_az: İmla yoxlama
fa_ir: غلط یاب

source: Spell Checking
az_az: İmla yoxlama
fa_ir: غلط یاب املایی

source: Reverse Search
az_az: Geridə Axtar
fa_ir: جستجوی نادقیق برعکس

source: Similar
az_az: Oxşar
fa_ir: مشابه

source: Quit
az_az: Çıx
fa_ir: خروج

source: Please enter clause.
az_az: Lütfən bir kəlmə yazın.
fa_ir: لطفا یک واژه وارد نمایید.

source: Please wait...
az_az: Lütfən Gözləyin
fa_ir: لطفا صبر کنید...

source: Phrase not found.
az_az: Kəlmə tapılmadı.
fa_ir: واژه یافت نشد.

source: xFarDic spell checker found error(s) on your typed word. Please choose correct word from list and then click OK.
az_az: xFarDic İmla yoxlayıcisinin verdiyiniz kəlmədə yanlış(lar) tapdı. Zəhmət olmasa kəlməni düzgün ifadə ilə yazın.
fa_ir: غلط یاب املایی ایکس‌فاردیک خطاهایی را در واژه تایپ شده شما پیدا کرد. لطفا واژه صحیح را از لیست انتخاب کنید.

source: xFarDic Spell Checker
az_az: xFarDic İmla yoxlanicisi
fa_ir: غلط یاب املایی ایکس‌فاردیک

source: xFarDic Preferences
fa_ir: ترجیحات ایکس‌فاردیک

source: About xFarDic
az_az: xFarDic Haqqında
fa_ir: درباره ایکس‌فاردیک

source: xFarDic - Leitner Box
fa_ir: ایکس‌فاردیک - جعبه لایتنر

source: It seems that Aspell is not installed. xFarDic will not work correctly.
az_az: Görünür Aspell qurulmayıb. xFardic düzgün işləməyəcək.
fa_ir: به نظر می‌رسد که Aspell نصب نشده است. ایکس‌فاردیک درست کار نخواهد کرد.

source: Parse Error. Invalid Document. It is possible that XML-DB is not installed. Set XML DB path in settings window.
az_az: Xəta : etibarsiz verilərin bazası. Bəlkədə XML VB'sini qurmayıbsiniz.VB Adresini Seçimlər pəncərəsindən yoxlayın.
fa_ir: خطا: بانک اطلاعاتی نامعتبر است. ممکن است بانک اطلاعاتی نصب نشده باشد. مسیر بانک اطلاعاتی را از پنجره ترجیحات تعیین کنید.

source: Selected word already exists in the box or not found in the installed database(s).
fa_ir: کلمه انتخاب شده در حال حاضر موجود است یا در بانک‌های وازه نصب شده یافت نشده است.

source: The leitner box is full.
fa_ir: ظرفیت جعبه لایتنر تکمیل است.

source: xFarDic should be restarted to work correctly. Would you like to close it now?
fa_ir: برای عملکرد صحیح، ایکس‌فاردیک باید مجددا اجرا شود. اکنون مایل به بستن آن هستید؟

source: Creating the swap file. Please wait. This will take a while...
fa_ir: در حال ایجاد فایل swap. لطفا صبر کنید. این کار ممکن است طول بکشد...

source: displays this help message
fa_ir: نمایش این پیام راهنما

source: Another program instance is already running, aborting.
az_az: Bu proqram bir dəfə açilib və indiysə fəaldır.
fa_ir: نسخه دیگری از برنامه در حال اجراست.
